Repository: MohitJava/vercel-wp
Catalog: languages/vercel-wp-*.po
Languages: fr_fr

source: Deploy to Vercel
fr_fr: Déployer vers Vercel

source: Deploy
fr_fr: Déployer

source: Settings
fr_fr: Paramètres

source: Webhook Settings
fr_fr: Paramètres webhook

source: The build and deploy status will not work without these fields entered correctly
fr_fr: Le statut de build et de déploiement ne fonctionnera pas sans que ces champs soient correctement remplis

source: Webhook Build URL
fr_fr: URL webhook de build

source: Vercel Project ID
fr_fr: ID projet Vercel

source: Vercel API Key
fr_fr: Clé API Vercel

source: Build Website
fr_fr: Construire le site

source: Build Site
fr_fr: Construire le site

source: Do not abuse the Build Site button
fr_fr: N'abusez pas du bouton construire le site

source: Deploy Status
fr_fr: Statut de déploiement

source: Check Deploy Status
fr_fr: Vérifier le statut de déploiement

source: Previous Builds
fr_fr: Builds précédents

source: Load Previous Deploys
fr_fr: Charger les déploiements précédents

source: Do not change this if you dont know what you are doing.
fr_fr: Ne modifiez pas ceci si vous ne savez pas ce que vous faites.

source: Creating a Deploy Hook
fr_fr: Créer un deploy hook

source: Your settings have been updated!
fr_fr: Vos paramètres ont été mis à jour !

source: Deploy Site
fr_fr: Déployer le site

source: Vercel deploy status
fr_fr: Statut de déploiement Vercel

source: Configuration Guide
fr_fr: Guide de configuration

source: Follow these steps to get the required information from Vercel:
fr_fr: Suivez ces étapes pour obtenir les informations requises de Vercel :

source: 1. Webhook Build URL
fr_fr: 1. URL webhook de build

source: Go to your Vercel project dashboard
fr_fr: Allez sur le tableau de bord de votre projet Vercel

source: Navigate to Settings → Git
fr_fr: Naviguez vers paramètres → Git

source: Scroll down to "Deploy Hooks" section
fr_fr: Faites défiler vers la section "Deploy Hooks"

source: Click "Create Hook" and give it a name
fr_fr: Cliquez sur "Create Hook" et donnez-lui un nom

source: Copy the generated webhook URL
fr_fr: Copiez l'URL webhook générée

source: → Detailed Deploy Hook Documentation
fr_fr: → Documentation détaillée des deploy hooks

source: 2. Vercel Project ID
fr_fr: 2. ID projet Vercel

source: Navigate to Settings → General
fr_fr: Naviguez vers paramètres → Général

source: Find "Project ID" in the Project Information section
fr_fr: Trouvez "Project ID" dans la section informations du projet

source: Copy the Project ID
fr_fr: Copiez l'ID projet

source: 3. Vercel API Key
fr_fr: 3. Clé API Vercel

source: Go to Vercel Account Settings
fr_fr: Allez dans les paramètres du compte Vercel

source: Navigate to Tokens section
fr_fr: Naviguez vers la section tokens

source: Click "Create Token" and give it a name
fr_fr: Cliquez sur "Create Token" et donnez-lui un nom

source: Set expiration date (recommended: 1 year)
fr_fr: Définissez la date d'expiration (recommandé: 1 an)

source: Copy the generated token
fr_fr: Copiez le token généré

source: → API Key Documentation
fr_fr: → Documentation des clés API

source: Configure your Vercel preview URL
fr_fr: Configurez votre URL de prévisualisation Vercel

source: Optionally, add your production URL for mapping
fr_fr: Optionnellement, ajoutez votre URL de production pour le mapping

source: The preview button will appear in the admin bar and editor
fr_fr: Le bouton de prévisualisation apparaîtra dans la barre d'administration et l'éditeur

source: Click to see your changes in real time
fr_fr: Cliquez pour voir vos changements en temps réel

source: URL Replacement
fr_fr: Remplacement d'URL

source: If you have changed your production URL, use this tool to replace all old URLs in your content.
fr_fr: Si vous avez changé votre URL de production, utilisez cet outil pour remplacer toutes les anciennes URLs dans votre contenu.

source: This plugin's data is automatically excluded from replacement to prevent any corruption.
fr_fr: Les données de ce plugin sont automatiquement exclues du remplacement pour éviter toute corruption.

source: Old URL:
fr_fr: Ancienne URL :

source: New URL:
fr_fr: Nouvelle URL :

source: Analyze Content
fr_fr: Analyser le contenu

source: Confirm Replacement
fr_fr: Confirmer le remplacement

source: Cancel
fr_fr: Annuler

source: Please enter both URLs
fr_fr: Veuillez saisir les deux URLs

source: URLs must be different
fr_fr: Les URLs doivent être différentes

source: Analyzing...
fr_fr: Analyse en cours...

source: Analyzing content...
fr_fr: Analyse du contenu en cours...

source: Analysis completed
fr_fr: Analyse terminée

source: Occurrences found:
fr_fr: Occurrences trouvées :

source: Metadata
fr_fr: Métadonnées

source: Comments
fr_fr: Commentaires

source: Ready for replacement
fr_fr: Prêt pour le remplacement

source: Total elements to modify:
fr_fr: Total d'éléments à modifier :

source: No occurrences found
fr_fr: Aucune occurrence trouvée

source: No content needs to be updated.
fr_fr: Aucun contenu n'a besoin d'être mis à jour.

source: Analysis failed
fr_fr: Échec de l'analyse

source: Error during analysis
fr_fr: Erreur lors de l'analyse

source: REPLACEMENT SUMMARY
fr_fr: RÉSUMÉ DU REMPLACEMENT

source: Operation details
fr_fr: Détails de l'opération

source: Elements that will be modified:
fr_fr: Éléments qui seront modifiés :

source: Theme
fr_fr: Thème

source: Examples of modified content:
fr_fr: Exemples de contenu modifié :

source: Modification of
fr_fr: Modification de

source: elements
fr_fr: éléments

source: Make sure you have a backup before continuing.
fr_fr: Assurez-vous d'avoir une sauvegarde avant de continuer.

source: Available actions:
fr_fr: Actions disponibles :

source: CONFIRM
fr_fr: CONFIRMER

source: ABORT
fr_fr: ANNULER

source: Replacement in progress...
fr_fr: Remplacement en cours...

source: Initializing...
fr_fr: Initialisation...

source: Replacing URLs...
fr_fr: Remplacement des URLs...

source: Fixing ACF fields...
fr_fr: Correction des champs ACF...

source: Clearing caches...
fr_fr: Nettoyage des caches...

source: Finalizing...
fr_fr: Finalisation...

source: Replacement completed successfully!
fr_fr: Remplacement terminé avec succès !

source: Result:
fr_fr: Résultat :

source: elements modified successfully
fr_fr: éléments modifiés avec succès

source: Modification details:
fr_fr: Détails des modifications :

source: Replacement failed
fr_fr: Échec du remplacement

source: Error during replacement
fr_fr: Erreur lors du remplacement

source: ACF Debug - Diagnostic Information
fr_fr: Debug ACF - Informations de diagnostic

source: Debug information to diagnose ACF field replacement issues.
fr_fr: Informations de debug pour diagnostiquer les problèmes de remplacement des champs ACF.

source: Show ACF Debug
fr_fr: Afficher le debug ACF

source: Clear Debug
fr_fr: Effacer le debug

source: Inspect ACF Field
fr_fr: Inspecter un champ ACF

source: If your project is in a Team, make sure to set your team as the Default Team in Account Settings.
fr_fr: Si votre projet est dans une équipe, assurez-vous de définir votre équipe comme équipe par défaut dans les Paramètres du Compte.

source: Vercel Deploy
fr_fr: Déploiement Vercel

source: Deploy your WordPress site to Vercel with one click
fr_fr: Déployez votre site WordPress sur Vercel en un clic

source: Configuration Required
fr_fr: Configuration requise

source: Please configure your Vercel settings before deploying.
fr_fr: Veuillez configurer vos paramètres Vercel avant de déployer.

source: Go to Settings
fr_fr: Aller aux Paramètres

source: Deploy Now
fr_fr: Déployer Maintenant

source: Trigger a new deployment
fr_fr: Déclencher un nouveau déploiement

source: This will trigger a new build and deployment of your site.
fr_fr: Cela déclenchera une nouvelle construction et un déploiement de votre site.

source: Deployment Status
fr_fr: Statut de déploiement

source: Check current deployment status
fr_fr: Vérifier le statut de déploiement actuel

source: Check Status
fr_fr: Vérifier le Statut

source: No active deployment found
fr_fr: Aucun déploiement actif trouvé

source: Deployment History
fr_fr: Historique des déploiements

source: View previous deployments
fr_fr: Voir les déploiements précédents

source: Load History
fr_fr: Charger l'Historique

source: Quick Actions
fr_fr: Actions Rapides

source: Vercel Dashboard
fr_fr: Tableau de bord Vercel

source: Vercel Status
fr_fr: Statut Vercel

source: Checking status...
fr_fr: Vérification du statut...

source: Refresh
fr_fr: Actualiser

source: System Info
fr_fr: Informations système

source: Plugin Version:
fr_fr: Version du Plugin :

source: Complete
fr_fr: Complète

source: Incomplete
fr_fr: Incomplète

source: Recent Activity
fr_fr: Activité récente

source: No recent activity
fr_fr: Aucune activité récente

source: Branch:
fr_fr: Branche :

source: Created:
fr_fr: Créé :

source: Duration:
fr_fr: Durée :

source: Status:
fr_fr: Statut :

source: Deployed by:
fr_fr: Déployé par :

source: Environment:
fr_fr: Environnement :

source: Please configure the following required settings before deploying:
fr_fr: Veuillez configurer les paramètres requis suivants avant de déployer :

source: Please configure all required settings before deploying. Missing: %s
fr_fr: Veuillez configurer tous les paramètres requis avant de déployer. Manquant : %s

source: Webhook URL not configured. Please set up your webhook URL in the settings.
fr_fr: URL du webhook non configurée. Veuillez configurer votre URL de webhook dans les paramètres.

source: Deployment Not Available
fr_fr: Déploiement non disponible

source: Webhook URL is required to deploy your site. Please configure it in the settings.
fr_fr: L'URL du webhook est requise pour déployer votre site. Veuillez la configurer dans les paramètres.

source: Configure Webhook URL
fr_fr: Configurer l'URL du webhook

source: Additional Configuration Available
fr_fr: Configuration additionnelle disponible

source: You can deploy now, but for full functionality, configure these additional settings:
fr_fr: Vous pouvez déployer maintenant, mais pour une fonctionnalité complète, configurez ces paramètres supplémentaires :

source: Configure Additional Settings
fr_fr: Configurer les paramètres supplémentaires

source: Checking Vercel status...
fr_fr: Vérification du statut Vercel...

source: Deploying…
fr_fr: Déploiement en cours…

source: Deploy building...
fr_fr: Déploiement en cours...

source: Deployment completed successfully!
fr_fr: Déploiement terminé avec succès !

source: Deployment failed
fr_fr: Déploiement échoué

source: Load Last 3 Deployments
fr_fr: Charger les 3 derniers déploiements

source: Load Full History
fr_fr: Charger l'historique complet

source: Recent deployments
fr_fr: Déploiements récents

source: Vercel Status - Click to view
fr_fr: Statut Vercel - Cliquer pour voir

source: Deploy Settings
fr_fr: Paramètres de déploiement

source: Configure your Vercel deployment settings.
fr_fr: Configurez vos paramètres de déploiement Vercel.

source: Quick Links
fr_fr: Liens rapides

source: 📊 Vercel Dashboard
fr_fr: 📊 Tableau de bord Vercel

source: 📚 Vercel Docs
fr_fr: 📚 Documentation Vercel

source: 📖 Deploy Hook Docs
fr_fr: 📖 Documentation deploy hook

source: 📖 API Key Docs
fr_fr: 📖 Documentation clés API

source: Loading...
fr_fr: Chargement...

source: Error loading
fr_fr: Erreur lors du chargement

source: Clear cache
fr_fr: Vider le cache

source: Open preview
fr_fr: Ouvrir la prévisualisation

source: Preview
fr_fr: Prévisualiser

source: New tab
fr_fr: Nouvel onglet

source: Close
fr_fr: Fermer

source: Tablet
fr_fr: Tablette

source: Connected
fr_fr: Connecté

source: Preview blocked
fr_fr: Prévisualisation bloquée

source: Your browser blocks the display. Click below to open in a new tab.
fr_fr: Votre navigateur bloque l'affichage. Cliquez ci-dessous pour ouvrir dans un nouvel onglet.

source: Open in new tab
fr_fr: Ouvrir dans un nouvel onglet

source: Unable to load preview
fr_fr: Impossible de charger la prévisualisation

source: Preview cannot be loaded. Check your configuration.
fr_fr: La prévisualisation ne peut pas être chargée. Vérifiez votre configuration.

source: Retry
fr_fr: Réessayer

source: Security error
fr_fr: Erreur de sécurité

source: Settings saved
fr_fr: Paramètres sauvegardés

source: Cache cleared
fr_fr: Cache vidé

source: Cache cleared via Vercel API
fr_fr: Cache vidé via API Vercel

source: Cache timestamp updated (Vercel API not configured)
fr_fr: Horodatage du cache mis à jour (API Vercel non configurée)

source: Preview URL missing
fr_fr: URL de prévisualisation manquante

source: Too many redirects detected.
fr_fr: Trop de redirections détectées.

source: Connection timeout. URL takes too long to respond.
fr_fr: Timeout de connexion. L'URL met trop de temps à répondre.

source: SSL error. Check that the URL uses HTTPS correctly.
fr_fr: Erreur SSL. Vérifiez que l'URL utilise HTTPS correctement.

source: Connection error: %s
fr_fr: Erreur de connexion : %s

source: Connection successful! (HTTP Code: %d)
fr_fr: Connexion réussie ! (Code HTTP: %d)

source: - Redirected to: %s
fr_fr: - Redirigé vers: %s

source: HTTP error %d. Check that the URL is accessible.
fr_fr: Erreur HTTP %d. Vérifiez que l'URL est accessible.

source: Redirect chain detected: %s
fr_fr: Chaîne de redirections détectée: %s

source: Check that the URL is correct and accessible.
fr_fr: Vérifiez que l'URL est correcte et accessible.

source: URL not configured
fr_fr: URL non configurée

source: Connection active
fr_fr: Connexion active

source: Preview Settings
fr_fr: Paramètres de prévisualisation

source: Configure your Vercel preview and headless WordPress settings.
fr_fr: Configurez vos paramètres de prévisualisation Vercel et WordPress headless.

source: Vercel Preview URL
fr_fr: URL de Prévisualisation Vercel

source: URL of your site in preview mode on Vercel (e.g., https://your-site-git-branch.vercel.app)
fr_fr: URL de votre site en mode prévisualisation sur Vercel (ex: https://your-site-git-branch.vercel.app)

source: Production URL
fr_fr: URL de Production

source: Production URL of your site for path mapping
fr_fr: URL de production de votre site pour le mapping des chemins

source: Cache Duration
fr_fr: Durée du Cache

source: seconds
fr_fr: secondes

source: Duration for caching preview URLs (default: 300 seconds / 5 minutes)
fr_fr: Durée de mise en cache des URLs de prévisualisation (par défaut: 300 secondes / 5 minutes)

source: Display Options
fr_fr: Options d'Affichage

source: Show preview button in admin bar
fr_fr: Afficher le bouton de prévisualisation dans la barre d'admin

source: Show preview buttons in post editor
fr_fr: Afficher les boutons de prévisualisation dans l'éditeur de posts

source: Enable auto-refresh for preview
fr_fr: Activer l'actualisation automatique pour la prévisualisation

source: Headless Options
fr_fr: Options Headless

source: Disable WordPress theme page (for headless setup)
fr_fr: Désactiver la page des thèmes WordPress (pour la configuration headless)

source: When enabled, the Appearance → Themes page will be hidden and redirected.
fr_fr: Quand activé, la page Apparence → Thèmes sera masquée et redirigée.

source: URL Replacement Tool
fr_fr: Outil de Remplacement d'URL

source: Use this tool to replace URLs in your content when migrating or changing domains.
fr_fr: Utilisez cet outil pour remplacer les URLs dans votre contenu lors de migrations ou changements de domaines.

source: This tool uses the same methodology as the Better Search Replace plugin to safely replace URLs in serialized data.
fr_fr: Cet outil utilise la même méthodologie que le plugin Better Search Replace pour remplacer en toute sécurité les URLs dans les données sérialisées.

source: Old URL
fr_fr: Ancienne URL

source: The URL to search for and replace
fr_fr: L'URL à rechercher et remplacer

source: New URL
fr_fr: Nouvelle URL

source: The replacement URL
fr_fr: L'URL de remplacement

source: Preview Changes
fr_fr: Prévisualiser les changements

source: Replace URLs
fr_fr: Remplacer les URLs

source: Connection Test
fr_fr: Test de Connexion

source: How to use
fr_fr: Comment utiliser

source: Required Vercel Configuration
fr_fr: Configuration Vercel requise

source: Statistics
fr_fr: Statistiques

source: Last refresh:
fr_fr: Dernière actualisation :

source: Never
fr_fr: Jamais

source: Last production URL:
fr_fr: Dernière URL de production :

source: Testing...
fr_fr: Test en cours...

source: Connection successful!
fr_fr: Connexion réussie !

source: URL not accessible
fr_fr: URL inaccessible

source: Error during connection test.
fr_fr: Erreur lors du test de connexion.

source: Running advanced diagnostics...
fr_fr: Diagnostic avancé en cours...

source: Diagnostics completed
fr_fr: Diagnostic terminé

source: Error during diagnostics
fr_fr: Erreur lors du diagnostic

source: Unknown error
fr_fr: Erreur inconnue

source: Cancellation in progress...
fr_fr: Annulation en cours...

source: Cancellation completed successfully!
fr_fr: Annulation terminée avec succès !

source: All changes have been reversed.
fr_fr: Tous les changements ont été annulés.

source: ERROR:
fr_fr: ERREUR :

source: Error during cancellation
fr_fr: Erreur lors de l'annulation

source: Total items modified:
fr_fr: Total d'éléments modifiés :

source: Items processed:
fr_fr: Éléments traités :

source: Details
fr_fr: Détails

source: No elements found in this category
fr_fr: Aucun élément trouvé dans cette catégorie

source: Field
fr_fr: Champ

source: URL found
fr_fr: URL trouvée

source: Comment
fr_fr: Commentaire

source: Author
fr_fr: Auteur

source: Value
fr_fr: Valeur

source: Test Connection
fr_fr: Tester la connexion

source: Advanced Diagnostics
fr_fr: Diagnostics avancés

source: Preview Results:
fr_fr: Résultats de Prévisualisation :

source: Post Meta:
fr_fr: Méta Posts :

source: Comments:
fr_fr: Commentaires :

source: Are you sure you want to replace these URLs? This action cannot be undone.
fr_fr: Êtes-vous sûr de vouloir remplacer ces URLs ? Cette action ne peut pas être annulée.

source: Please enter a Vercel preview URL first
fr_fr: Veuillez d'abord saisir une URL de prévisualisation Vercel

source: Testing connection...
fr_fr: Test de connexion en cours...

source: Running diagnostics...
fr_fr: Exécution des diagnostics...

source: Settings saved successfully!
fr_fr: Paramètres sauvegardés avec succès !

source: Production URL changed!
fr_fr: URL de production modifiée !

source: Old URL: %s
fr_fr: Ancienne URL : %s

source: New URL: %s
fr_fr: Nouvelle URL : %s

source: Recommended action:
fr_fr: Action recommandée :

source: Use the "URL Replacement" tool below to update all links in your content.
fr_fr: Utilisez l'outil "Remplacement d'URL" ci-dessous pour mettre à jour tous les liens dans votre contenu.

source: Configure your Vercel deployment and preview settings
fr_fr: Configurez vos paramètres de déploiement et prévisualisation Vercel
